2750257x-blip/Origional_STM32_Control_Code-main/Core/Src/main.c
  // 收到Nano发来的二维码动作指令，切换动作模�??????
  // if(action_state != ACTION_IDLE)
  // {
  //   robot_state = ROBOT_STATE_ACTION;
  //   LCD_DisplayText(10, 10, "Mode : ACTION");
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  // }
  // if(system_control_warning >= 10 || motor_status_fault != 0 || motor_status_mode != 0x0FFF) {
  //   robot_state = ROBOT_STATE_ERROR; // 如果连续3个周期没有正常控制，切换到异常状�??????
  //   LCD_ClearRect(10, 10, 240, 24);
  //   LCD_DisplayText(10, 10, "Mode : ERROR");
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); 
  //   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  // }
  if(imu_warning >=2 && imu_warning <=100) {
  imu_change_to_request();                // 切到请求模式才能配置
  HAL_Delay(20);
  imu_set_active_mode_delay(10);          // 100Hz (10ms)
  imu_write_reg(DATA_OUTPUT_SELECTION, 1);// 1=四元�?, 0=欧拉角（6轴始终输出）
  imu_save_parameters();                  // 保存到IMU内部Flash
  HAL_Delay(20);
  imu_change_to_active();                 // 切换到主动模�?
  }
}

void ROBOT_RHAND(void)
{
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(10, 10, "Mode : RHAND");
  Servo_SetAngle(&htim1, TIM_CHANNEL_1, 0);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  HAL_Delay(3200);
  Servo_SetAngle(&htim1, TIM_CHANNEL_1, 30);
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(0, 10, "Mode : IDLE");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
}

void ROBOT_LHAND(void)
{
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(10, 10, "Mode : LHAND");
  Servo_SetAngle(&htim1, TIM_CHANNEL_2, 180);
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  HAL_Delay(3200);
  Servo_SetAngle(&htim1, TIM_CHANNEL_2, 150);
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(0, 10, "Mode : IDLE");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
}

void ROBOT_HEAD(void)
{
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(10, 10, "Mode : HEAD");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 0);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 180);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 0);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 180);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 0);
  HAL_Delay(600);
  Servo_SetAngle(&htim1, TIM_CHANNEL_3, 90);
  HAL_Delay(200);
  LCD_ClearRect(10, 10, 240, 24);
  LCD_DisplayText(0, 10, "Mode : IDLE");
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
}

void ROBOT_RESET(void)
{
  if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_0) == GPIO_PIN_SET){
    motor_setzero();
    HAL_Delay(200);
    }
}

void ROBOT_TEST(void)
{
  if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_0) == GPIO_PIN_SET){
    HAL_Delay(200);
    HAL_TIM_Base_Start_IT(&htim2); // 启动定时器中断（用于周期性任务）
  }
  if(controldata1ready == 1 && controldata1number == 1) {
    controldata1ready = 0; // 重置数据就绪标志
    controldata1number = 0;

    EL05_Motor_Ctrl(&hfdcan1, r_leg_pitch, 0.0f, leg_control[0], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan1, r_leg_roll, 0.0f, leg_control[1], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan1, r_leg_yaw, 0.0f, leg_control[2], 0.0f, 50.0f, 5.0f);
    
    EL05_Motor_Ctrl(&hfdcan2, l_leg_pitch, 0.0f, leg_control[6], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan2, l_leg_roll, 0.0f, leg_control[7], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan2, l_leg_yaw, 0.0f, leg_control[8], 0.0f, 50.0f, 5.0f);

  }
    
  if(controldata1ready == 1 && controldata1number == 0) {
    controldata1ready = 0; // 重置数据就绪标志
    controldata1number = 1;

    EL05_Motor_Ctrl(&hfdcan1, r_knee_pitch, 0.0f, leg_control[3], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan1, r_ankle_pitch, 0.0f, leg_control[4], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan1, r_ankle_roll, 0.0f, leg_control[5], 0.0f, 50.0f, 5.0f);

    EL05_Motor_Ctrl(&hfdcan2, l_knee_pitch, 0.0f, leg_control[9], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan2, l_ankle_pitch, 0.0f, leg_control[10], 0.0f, 50.0f, 5.0f);
    EL05_Motor_Ctrl(&hfdcan2, l_ankle_roll, 0.0f, leg_control[11], 0.0f, 50.0f, 5.0f);
  }
    
    //发�?�电机状�??????
    __disable_irq();
    uint16_t motor_status_ready_copy = motor_status_ready;
    memcpy(&usb_tx_buffer[0], motor_status_buf, sizeof(motor_status_buf));
    __enable_irq();
    if (motor_status_ready_copy == 0x3F) { 
      if (CDC_Transmit_HS(&usb_tx_buffer[0], sizeof(motor_status_buf)) == USBD_OK) {
        __disable_irq();
        motor_status_ready = 0;
        __enable_irq();
      }
    }
}

void ROBOT_TEST_ACTION(void)
{
    if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_0) == GPIO_PIN_SET){
    HAL_Delay(200);
    Action_Goto(0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 50);
    }
    if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_1) == GPIO_PIN_SET){
    HAL_Delay(200);
    Action_Goto(1.3f, 0.0f, 0.0f, -1.6f, -0.1f, 0.0f, 0.0f, 0.4f, 0.0f, 0.0f, 0.0f, 0.5f, 50);
    }
    if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET){
    HAL_Delay(200);
    Action_Goto(0.15f, 0.0f, 0.0f, -0.30f, -0.15f, 0.0f, -0.15f, 0.0f, 0.0f, 0.30f, 0.15f, 0.00f, 50);
    }
}
//sk-f14f125467984078979ed8ef4f748cc5
void ROBOT_TEST_IMU(void)
{
  if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_0) == GPIO_PIN_SET){
    HAL_Delay(200);
    memset(usb_tx_buffer, 0, sizeof(usb_tx_buffer));
    HAL_TIM_Base_Start_IT(&htim2); // 启动定时器中断（用于周期性任务）
  }
  if(controldata1ready == 1 && controldata1number == 1) {
    controldata1ready = 0; // 重置数据就绪标志
    controldata1number = 0;

    imu_request_accel();
  }
    
  if(controldata1ready == 1 && controldata1number == 0) {
    controldata1ready = 0; // 重置数据就绪标志
    controldata1number = 1;
    
    imu_request_gyro();
    }
    
