2750257x-blip/Origional_STM32_Control_Code-main/Core/Src/main.c
    //发�?�IMU数据
    __disable_irq();
    uint8_t imu_data_ready_copy = imu_data_ready; 
    memcpy(&usb_tx_buffer[48], imu_buf, sizeof(imu_buf)); 
    __enable_irq();
    if (imu_data_ready_copy == 0x03) { // 假设IMU数据都就�??????
      if (CDC_Transmit_HS(&usb_tx_buffer[48], sizeof(imu_buf)+52) == USBD_OK) {
        __disable_irq();
        imu_data_ready = 0; // 重置计数
        __enable_irq();
      }
    }
}

void ROBOT_TEST_UART(void)
{
  if(uart_ready1) {
    HAL_UART_Transmit(&huart2, uart_rx_data1, 1, 100);
    Servo_SetAngle(&htim1, TIM_CHANNEL_1, uart_rx_data1[0]);
    uart_ready1 = 0;
  }
  if(uart_ready2) {
    HAL_UART_Transmit(&huart2, uart_rx_data2, 2, 100);

    if( uart_rx_data2[0] >= r_leg_pitch && uart_rx_data2[0] <= r_ankle_roll) {
      if(uart_rx_data2[1] == 0x00) {
        leg_control[uart_rx_data2[0]-r_leg_pitch] -= 0.1f;
      }if(uart_rx_data2[1] == 0x01) {
        leg_control[uart_rx_data2[0]-r_leg_pitch] += 0.1f;
      }
      EL05_Motor_Ctrl(&hfdcan1, uart_rx_data2[0], 0.0f, leg_control[uart_rx_data2[0]-r_leg_pitch], 0.0f, 50.0f, 5.0f);
    }

    if( uart_rx_data2[0] >= l_leg_pitch && uart_rx_data2[0] <= l_ankle_roll) {
      if(uart_rx_data2[1] == 0x00) {
        leg_control[uart_rx_data2[0]-l_leg_pitch+6] -= 0.1f;
      }if(uart_rx_data2[1] == 0x01) {
        leg_control[uart_rx_data2[0]-l_leg_pitch+6] += 0.1f;
      }
      EL05_Motor_Ctrl(&hfdcan2, uart_rx_data2[0], 0.0f, leg_control[uart_rx_data2[0]-l_leg_pitch+6], 0.0f, 50.0f, 5.0f);
    }
      
    uart_ready2 = 0;
  }
}

void ROBOT_TEST_INIT(void)
{
    if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_0) == GPIO_PIN_SET){
    HAL_Delay(200);
      motor_enable();
    }
    if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_1) == GPIO_PIN_SET){
    HAL_Delay(200);
    for (int i = 0; i < 12; i++) {
    if(motor_status_fault & (1 << i)) {
        // 这里可以添加针对未就绪电机的处理逻辑，例如重置电机状态并重新发�?�控制命令等
        EL05_Motor_Clear_Fault(i < 6 ? &hfdcan1 : &hfdcan2, i < 6 ? i + r_leg_pitch : i - 6 + l_leg_pitch);
        EL05_Motor_Enable(i < 6 ? &hfdcan1 : &hfdcan2, i < 6 ? i + r_leg_pitch : i - 6 + l_leg_pitch);
      }
     }
    }
    if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET){
    HAL_Delay(200);
    for (int i = 0; i < 12; i++) {
      EL05_Motor_Stop(i < 6 ? &hfdcan1 : &hfdcan2, i < 6 ? i + r_leg_pitch : i - 6 + l_leg_pitch);
     }
    }
}

void BUTTON_CHANGE(void)
{
  while(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_2) == GPIO_PIN_SET || HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4) == GPIO_PIN_SET) {
    HAL_TIM_Base_Stop_IT(&htim2);
    __HAL_TIM_SET_COUNTER(&htim2, 0);
    __HAL_TIM_CLEAR_FLAG(&htim2, TIM_FLAG_UPDATE);
    
     if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_2) == GPIO_PIN_SET) {
        if(button_pressed == 6) {
          button_pressed = 0; // 防止溢出
        }
        else {
          button_pressed ++;
        }
      }
      if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4) == GPIO_PIN_SET) {
        if(button_pressed == 0) {
          button_pressed = 6; // 防止溢出
        }
        else {
          button_pressed --;
        }
      }
      if(button_pressed == 0) {  // 按键0：正常模�??????
        LCD_ClearRect(10, 10, 240, 24);
        LCD_DisplayText(10, 10, "Mode : IDLE");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET); 
      }
      else if(button_pressed == 1) {  // 按键1：设零位
        LCD_ClearRect(10, 10, 240, 24);
        LCD_DisplayText(10, 10, "Mode : RESET");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET); 
      }
      else if(button_pressed == 2) {  // 按键2：测�??????
        LCD_ClearRect(10, 10, 240, 24);
        LCD_DisplayText(10, 10, "Mode : TEST");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET); 
      }
      else if(button_pressed == 3) { //动作测试
        LCD_ClearRect(10, 10, 240, 24);
        LCD_DisplayText(10, 10, "Mode : TEST_ACTION");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET); 
      }
      else if(button_pressed == 4) { // IMU测试
        LCD_ClearRect(10, 10, 240, 24);
        LCD_DisplayText(10, 10, "Mode : TEST_IMU");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
      }
      else if(button_pressed == 5) { // UART测试
        LCD_ClearRect(10, 10, 240, 24);
        LCD_DisplayText(10, 10, "Mode : TEST_UART");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
      }
      else if(button_pressed == 6) { // INIT测试
        LCD_ClearRect(10, 10, 240, 24);
        LCD_DisplayText(10, 10, "Mode : TEST_INIT");
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_1, GPIO_PIN_RESET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_2, GPIO_PIN_SET); 
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
      }
      HAL_Delay(1000);
    }

  if(button_pressed != button_pressed_last) {
    button_pressed_last = button_pressed;
    Close_All_Old_Func();
    switch(button_pressed)
    {
      case 0:
        robot_state = ROBOT_STATE_IDLE;
        break;
      case 1:
        robot_state = ROBOT_STATE_RESET;
        break;
      case 2:
        robot_state = ROBOT_STATE_TEST;
        Action_Goto(0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 50);
        break;
      case 3:
        robot_state = ROBOT_STATE_TEST_ACTION;
        break;
      case 4:
        robot_state = ROBOT_STATE_TEST_IMU; 
        break;
      case 5:
        robot_state = ROBOT_STATE_TEST_UART;
        HAL_UART_Receive_IT(&huart1, &uart_rx_buf1[uart_count1], 1);
        HAL_UART_Receive_IT(&huart2, &uart_rx_buf2[uart_count2], 1);
        break;
      case 6:
        robot_state = ROBOT_STATE_TEST_INIT;
        break;
      default:
        robot_state = ROBOT_STATE_IDLE;
        break;
    }
  }
}

void Close_All_Old_Func(void)
{
    // 1. 关闭定时器中�??????

    // 3. 关闭串口发�?�和接收
    HAL_UART_Abort(&huart1);
    HAL_UART_Abort(&huart2);

